In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ········

------------------------------

1. List each pair of actors that have worked together.

------------------------------

In [8]:
%%sql 
select * from sakila.film_actor
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 1, datetime.datetime(2006, 2, 15, 5, 5, 3))]

In [7]:
%%sql 
select * from sakila.film
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', 'Deleted Scenes,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42))]

In [9]:
%%sql 
select * from sakila.actor
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 'PENELOPE', 'GUINESS', datetime.datetime(2006, 2, 15, 4, 34, 33))]

In [20]:
%%sql
select fa1.actor_id, 
concat(a1.first_name, ' ', a1.last_name), 
concat(a2.first_name, ' ', a2.last_name)

from sakila.actor as a1

join film_actor as fa1 on a1.actor_id = fa1.actor_id

join film_actor as fa2 on (fa1.film_id = fa2.film_id) and (fa1.actor_id != fa2.actor_id)

join actor as a2 on a2.actor_id = fa2.actor_id

limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(1, 'PENELOPE GUINESS', 'CHRISTIAN GABLE'),
 (1, 'PENELOPE GUINESS', 'LUCILLE TRACY'),
 (1, 'PENELOPE GUINESS', 'SANDRA PECK'),
 (1, 'PENELOPE GUINESS', 'JOHNNY CAGE'),
 (1, 'PENELOPE GUINESS', 'MENA TEMPLE')]

------------------

2. For each film, list actor that has acted in more films.

----------------------

In [22]:
%%sql
select * from sakila.film_actor
limit 2;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 1, datetime.datetime(2006, 2, 15, 5, 5, 3)),
 (1, 23, datetime.datetime(2006, 2, 15, 5, 5, 3))]

In [29]:
%%sql
select concat(a.first_name, ' ', a.last_name) as name_actor, count(film_id) as num_pelis from sakila.film_actor as fa
join sakila.actor as a on a.actor_id = fa.actor_id
group by name_actor
order by num_pelis desc
limit 3;

 * mysql+pymysql://root:***@localhost/sakila
3 rows affected.

[('SUSAN DAVIS', 54), ('GINA DEGENERES', 42), ('WALTER TORN', 41)]

In [35]:
%%sql
with l_actor_numpelis as 
(select concat(a.first_name, ' ', a.last_name) as name_actor, count(film_id) as num_pelis 
from sakila.film_actor as fa
join sakila.actor as a on a.actor_id = fa.actor_id
group by name_actor
order by num_pelis desc
limit 3)

select * 
from l_actor_numpelis
limit 3;

 * mysql+pymysql://root:***@localhost/sakila
3 rows affected.

[('SUSAN DAVIS', 54), ('GINA DEGENERES', 42), ('WALTER TORN', 41)]

In [ ]:
select title, 
from sakila.film as f
join sakila.film_actor as fa on f.film_id = fa.film_id
join sakila.actor as a on a.actor_id = fa.actor_id

---------------

Copio la solución porque no consigo hacerlo

--------------------

In [36]:
%%sql
with actor_movies as (
  select actor_id, count(film_id) as num_films
  from film_actor
  group by actor_id
)

select f.title, concat(a.first_name, ' ', a.last_name) as best_actor
from (
        select film_id, actor_id, rank() over (partition by film_id
                                               order by actor_movies.num_films desc) as m
        from film_actor
        inner join actor_movies
        using (actor_id)
     ) as t

inner join actor a on t.actor_id = a.actor_id
inner join film f on t.film_id = f.film_id
where m = 1
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('ACADEMY DINOSAUR', 'MARY KEITEL'),
 ('ACE GOLDFINGER', 'SEAN GUINESS'),
 ('ADAPTATION HOLES', 'JULIANNE DENCH'),
 ('AFFAIR PREJUDICE', 'SCARLETT DAMON'),
 ('AFRICAN EGG', 'MATTHEW CARREY')]